app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @Comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "jkkjds"], ["body", "djkjsdjkd"], ["post_id", 5], ["created_at", "2019-07-30 22:02:04.851905"], ["updated_at", "2019-07-30 22:02:04.851905"]]