app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "khkjhk"], ["body", "kjjhjhjh"], ["created_at", "2019-07-30 22:01:57.841639"], ["updated_at", "2019-07-30 22:01:57.841639"]]
---
  def create
    #render plain: params[:post].inspect
    @post = Post.new(post_params);

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "title4"], ["body", "body4"], ["updated_at", "2019-07-30 18:18:04.591859"], ["id", 4]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)